backup_system/backup_launcher/scripts/network/h3c/setDNATIcmp.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
  <env:Header>
    <auth:Authentication env:mustUnderstand="1" xmlns:auth="http://www.h3c.com/netconf/base:1.0">
      <auth:AuthInfo>%authinfo%</auth:AuthInfo>
    </auth:Authentication>
  </env:Header>
  <env:Body>
	<rpc message-id ="101" xmlns="urn:ietf:params:xml:ns:netconf:base:1.0" xmlns:xc="urn:ietf:params:xml:ns:netconf:base:1.0">
		  <edit-config>
		    <target>
		      <running/>
		    </target>
		    <config>
		     <top xmlns="http://www.h3c.com/netconf/config:1.0">
   			<!-- <NAT>
			  <ServerOnInterfaces>
			    <Interface>
			     <IfIndex>196</IfIndex>
			      <ProtocolType>%natType%</ProtocolType>
			      <GlobalInfo>
			        <GlobalVRF></GlobalVRF>
			        <GlobalStartIpv4Address>%globalIp%</GlobalStartIpv4Address>
			        <GlobalEndIpv4Address>%globalIp%</GlobalEndIpv4Address>
			        <GlobalStartPortNumber>%globalPort%</GlobalStartPortNumber>
			        <GlobalEndPortNumber>%globalPort%</GlobalEndPortNumber>
			        <GlobalIfIndex/>
			      </GlobalInfo>
			      <LocalInfo>
			        <LocalVRF></LocalVRF> 
			        <LocalStartIpv4Address>%insideIp%</LocalStartIpv4Address>
			        <LocalEndIpv4Address/>
			        <LocalStartPortNumber>%insidePort%</LocalStartPortNumber>
			        <LocalEndPortNumber/>
			        <LocalSrvGroupNumber/>
			      </LocalInfo>
			    </Interface>
			  </ServerOnInterfaces>
			</NAT> -->
			
			<NAT>
            <ServerOnInterfaces>
              <Interface>
                <IfIndex>196</IfIndex>
                <ProtocolType>%natType%</ProtocolType>
                <GlobalInfo>
                  <GlobalVRF/>
                  <GlobalStartIpv4Address>%globalIp%</GlobalStartIpv4Address>
                  <GlobalEndIpv4Address/>
                  <GlobalStartPortNumber/>
                  <GlobalEndPortNumber/>
                  <GlobalIfIndex/>
                </GlobalInfo>
                <LocalInfo>
                  <LocalStartIpv4Address>%insideIp%</LocalStartIpv4Address>
                </LocalInfo>
              </Interface>
           
          
            </ServerOnInterfaces>
          </NAT>	
   			</top>
		    </config>
		  </edit-config>
		</rpc>
  </env:Body>
</env:Envelope>
